Revit 2017 API
ViewSchedule.GroupHeaders Method (Int32, Int32, Int32, Int32)
 Groups schedule header cells.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method will be obsolete from 2015. Use GroupHeaders(int, int, int, int, String) instead.")]
public void GroupHeaders(
	int top,
	int left,
	int bottom,
	int right
)
Visual Basic
<ObsoleteAttribute("This method will be obsolete from 2015. Use GroupHeaders(int, int, int, int, String) instead.")> _
Public Sub GroupHeaders ( _
	top As Integer, _
	left As Integer, _
	bottom As Integer, _
	right As Integer _
)
Visual C++
[ObsoleteAttribute(L"This method will be obsolete from 2015. Use GroupHeaders(int, int, int, int, String) instead.")]
public:
void GroupHeaders(
	int top,
	int left,
	int bottom,
	int right
)
Parameters
top
Type: System.Int32
 The index of the top row of the selected headers.
left
Type: System.Int32
 The index of the left column of the selected headers.
bottom
Type: System.Int32
 The index of the bottom row of the selected headers.
right
Type: System.Int32
 The index of the right column of the selected headers.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Headers could not be grouped.
See Also
ViewSchedule Class
GroupHeaders Overload
Autodesk.Revit.DB Namespace